---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WallSweepInfo Constructor
WallSweepInfo Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | WallSweepInfo(Boolean, WallSweepType) | Constructs a new WallSweepInfo instance. |
|  | WallSweepInfo(WallSweepType, Boolean) | Constructs a new WallSweepInfo instance. |

# See Also

WallSweepInfo Class

WallSweepInfo Members

Autodesk.Revit.DB Namespace